Autodesk.Revit.DB.FilteredElementCollector.GetElementIteratorInternal
Returns an element iterator to the elements passing the filters.
Remarks:
Calling this when you have an active iterator to this same collector will result in the first iterator being
stopped by this call.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The collector does not have a filter applied.  Extraction or iteration of elements is not permitted without a filter.
Since:
2011

Autodesk.Revit.DB.FilteredElementCollector.Excluding(System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Applies an ExclusionFilter to the collector.
Remarks:
Elements passed to this filter will be automatically excluded from the results.
If you have an active iterator to this collector it will be stopped by this call.
idsToExclude:
The ids to exclude from the results.
Returns:
A handle to this collector.  This is the same collector that has just been modified, returned
so you can chain multiple calls together in one line.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input collection of ids was empty, or its contents were not valid for iteration.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.FilteredElementCollector.GetEnumerator
Returns an enumerator that iterates through the collection.
Returns: An IEnumerator(Autodesk.Revit.DB.Element) object that can be used to iterate through the collection.

Autodesk.Revit.DB.FilteredElementCollector.#ctor(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Constructs a new FilteredElementCollector that will search and filter a specified set of elements.
document:
The document that owns the elements matching the element ids.
elementIds:
The input set of element ids.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input collection of ids was empty, or its contents were not valid for iteration.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011